src/examples/5_icons/syntax/graphviz.dot
digraph G {
    subgraph cluster_0 {
        label="aws"
        aws_db [image="https://icons.d2lang.com/azure/Databases%20Service%20Color/Azure%20Database%20for%20PostgreSQL%20servers.svg"]
        cache [image="https://icons.d2lang.com/azure/_Companies/Azure%20Cache%20Redis%20Product%20icon.svg"]
        ec2 [image="https://icons.d2lang.com/aws/_Group%20Icons/EC2-instance-container_light-bg.svg"]

        ec2 -> aws_db [label="get persisted data", dir="both"]
        ec2 -> cache [label="get temporal data", dir="both"]
    }

    subgraph cluster_1 {
        label="gcloud"
        gcloud_db [image="https://icons.d2lang.com/azure/Databases%20Service%20Color/Azure%20Database%20for%20PostgreSQL%20servers.svg"]
    }

    aws_db -> gcloud_db [label="backup"]

    dev [image="https://icons.d2lang.com/essentials/005-programmer.svg"]
    github [image="https://icons.d2lang.com/dev/github.svg"]

    dev -> ec2 [label="ssh"]
    dev -> github [label="version control"]
}
